PC1/PC1_intro.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-30 ter 10:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Introdução</title>
<meta name="author" content="Daniel R. Cassar" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Introdução</h1>
Bem-vinda(o) à disciplina de Práticas Computacionais I.

<p>
A maioria das práticas contém um breve texto introdutório e uma ou mais questões. As questões são marcadas com uma letra em negrito e entre chaves. <b>[A]</b> Por exemplo, aqui seria o enunciado da questão <b>A</b> se estivéssemos dentro do escopo de uma prática.
</p>

<p>
Realize as práticas seguindo as instruções discutidas em sala de aula. Lembre-se que a capacidade de ler, entender, escrever, e depurar seu próprio código de computador é <i>fundamental</i> para realizar diversas disciplinas da Ilum (incluindo, obviamente, todas as disciplinas de computação). Por este motivo, se atente às dicas abaixo:
</p>

<ul class="org-ul">
<li>A maioria das práticas são individuais. Tente resolver as questões no seu computador antes de discutir em grupo. Depois de tentar resolver, fique à vontade para discutir em grupo e observar outras formas de resolver o mesmo problema;</li>

<li>Algumas práticas te convidam a executar algum código pronto para ver o que acontece. Mesmo sendo possível copiar e colar o código, é fortemente recomendado <i>escrever</i> o código pois aprendemos mais quando escrevemos do que quando copiamos e colamos;</li>

<li>Praticamente todos os problemas computacionais que serão explorados nesta disciplina já foram resolvidos por alguém e a solução pode ser encontrada em livros ou na internet. Isso é inevitável para problemas <i>simples</i>. Mais adiante no curso (ou na vida) iremos nos deparar com problemas mais <i>difíceis</i> e mais específicos, que não têm soluções prontas. Para resolver problemas difícies precisamos ter uma base sólida que só adquirimos resolvendo problemas mais simples. Aproveite esse momento de aprendizado e evite buscar respostas prontas <i>antes</i> de tentar resolver o problema! Depois que você tentou resolver, fique à vontade para procurar e estudar outras soluções.</li>
</ul>

<p>
Ao fim de todas as práticas é necessário enviar o seu caderno de notas Jupyter na plataforma Moodle. Preencha seu caderno de notas seguindo o modelo fornecido. O nome do arquivo deve conter seu nome, sobrenome e RA.
</p>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel R. Cassar</p>
<p class="date">Created: 2021-11-30 ter 10:43</p>
</div>
</body>
</html>
